Revit 2024 API
IFCAggregate.GetIFCAggregateIterator Method
 Returns a IFCAggregateIterator that iterates through the collection.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public IFCAggregateIterator GetIFCAggregateIterator()
Visual Basic
Public Function GetIFCAggregateIterator As IFCAggregateIterator
Visual C++
public:
IFCAggregateIterator^ GetIFCAggregateIterator()
See Also
IFCAggregate Class
Autodesk.Revit.DB.IFC Namespace